{
  "parrafo1": {
    "title": "Una breve introducción",
    "description": "Mi nombre es Andrés Gómez y vivo en Buenos Aires, Argentina. Soy Web Developer Front-End y Full Stack en progreso. Tengo muchos años de experiencia en sectores fuera del área IT, en industrias metalúrgicas y metalmecánicas.\nEn todos esos años aprendí y estoy acostumbrado al trabajo en equipo, también al liderazgo, a la gestión de proyectos y creo que a lo más importante para mí, que es aprender de la práctica del día a día.\nComencé con el desarrollo web en el año 2021, buscando una alternativa laboral y una forma de superarme profesionalmente, ya que nunca tuve una alternativa factible para poder estudiar y desarrollarme en una carrera que sea de mi agrado por razones económicas; desde entonces me capacité en varias formaciones de frontend, backend y como autodidacta.\nTengo una gran variedad de proyectos creados en mi repositorio de GitHub, como encriptadores de texto, conversores de unidades, páginas web, CV, entre otros, realizados para dichas formaciones utilizando diferentes lenguajes y tecnologías. También muchos otros realizados por mi cuenta para reforzar conocimientos y adquirir práctica como generadores de password, calculadoras, programas para controles de horario de empresas, carritos de compras, buscadores de películas, diseños de barras de navegación y demás.\nLo que busco es poder continuar desarrollándome profesionalmente y obteniendo conocimientos en lo que realmente descubrí que me apasiona."
  },
  "parrafo2": {
    "title": "El Génesis laboral",
    "description": "Comencé con mi desarrollo laboral en el año 2007 al terminar el colegio secundario. Como muchos jóvenes a esa edad, la indecisión de no saber como continuar al terminar esa etapa educacional es un punto totalmente en contra y muy común en nuestro país... continuar estudiando en la Universidad para un futuro más prospero, pero teniendo los recursos y la templanza necesaria para asistir a esta... o independizarse y salir a la jungla laboral con los ojos vendados y atados de pies y manos.\nMi opción fue la segunda.\nSalir a dejar CV a cuanta empresa te encuentras por el camino, caminar horas bajo el sol en los Parques industriales tratando de que alguien pueda tomarte en cuenta y darte una oportunidad para iniciarte en algo (no importa que), usar la excusa de comprar algo en un kiosco para preguntar si no necesita un empleado, dejar un curriculum amablemente y al darte vuelta escuchar como lo rompen o lo tiran a la basura, largas filas y horas de vida en consultoras laborales, era algo normal de todos los días... la conclusión es siempre la misma, necesitas experiencia para que te tomen en cuenta, pero nadie te da la oportunidad de conseguirla... un círculo del que es muy difícil salir, pero no imposible.\nLa persistencia y la autodisciplina toman un valor muy importante en ese momento donde abandonar no es una opción."
  },
  "parrafo3": {
    "title": "Caminando hacia la proa",
    "description": "La oportunidad llegó, tarde o temprano la puerta se abre. Alguien te da la oportunidad de demostrar de que estás hecho y sumar algunos renglones por primera vez a tu historial laboral. La felicidad se hace notar y la palabra 'decepcionar' no existe en tu diccionario...\n¿¡Barcos!??? Nunca imaginé que fueran tan grandes... y así arranqué, con la vista siempre hacia la proa. Vivir entre cañerías, fierros, bulones, tuercas y máquinas de soldar para repararlos, conocer los mil y un lugares dentro de ellos en los que puede llegar a romperse lo más inesperado, entrar en lugares muy pequeños donde jamás pensaste que estarías, la amistad laboral y el compañerismo... todo eso de a poco se fue haciendo parte de mi piel.\nAprendí más de lo que creía en muy poco tiempo y sin darme cuenta, siempre con curiosidad y ganas de superarme. ¿Me gustaba? Claro que sí... tenía mucha pasión, en un momento pensé que era para lo que había nacido y mi forma de contribuir a la sociedad.\nPero no todo lo bueno dura para siempre, un año después la empresa cambió su administración y muchos se quedaron sin su lugar de trabajo sin aviso. Y a mí también me tocó, 'Vos el nuevo... ya no hay lugar'. La palabra 'decepcionar' no existía en mi diccionario, pero sí en el de ellos. La puerta volvía a cerrarse, pero esta vez ya tenía algunas armas con que defenderme... la lucha sería un poco más fácil, eso pensé."
  },
  "parrafo4": {
    "title": "No me gusta el pollo",
    "description": "Mi papá fue la respuesta a una pregunta que se presentaba nuevamente... cómo y por donde continuar. Vino desde una provincia de Argentina a Buenos Aires muy joven, buscando un futuro mejor como muchos otros. Con una mano atrás y otra adelante, y solo con un poco de ropa en su valija, supo valerse por sí solo en la ciudad y salir a flote. Luego de vivir en una casa de barro en su lugar de origen, cosechar algodón desde pequeño y casi sin estudios, todo era nuevo para él, pero no se daría por vencido. Luego de años, mucha adversidad y sacrificio, pudo construir una casa, formar una familia y conseguir un trabajo estable... trabajo en el que estuvo por más de 30 años, y en el cual hoy se ofrecía a tratar de que yo, su hijo, pudiera comenzar y seguir sus pasos.\n¿¡Pollos!??? Una reconocida marca de crianza, y venta de pollos y huevos para consumo nacional me abría sus puertas.\n¡Gracias por la oportunidad! Pero no tardé mucho tiempo en darme cuenta de que eso no era lo mío. Acostumbrado a mi anterior trabajo, viviendo entre los fierros, los caños y las chispas de soldadura en los barcos... era un cambio muy brusco y rotundo para mí. Tan solo un mes después decido renunciar, agotado por estar a veces más de 18 horas fuera de mi casa, la distancia del viaje, el horario laboral y no tener días libres, me di cuenta de que el esfuerzo que estaba entregando era demasiado para algo que no me terminaba de convencer... y así pasé a ser nuevamente un desempleado, y además sin un techo a donde volver.\nLa decepción sobre mi persona por dicha renuncia consumió y se apoderó de mi papá... y por discusiones con él, estaba obligado a irme de casa.\n¡Mil disculpas! Pero no era para mí, nunca logré ver un futuro en esa empresa."
  },
  "parrafo5": {
    "title": "Viajar es mi pasión",
    "description": "A la deriva... sin trabajo y sin un lugar a donde ir... esa era mi situación. Otra vez, abandonar no era una opción. La madre de un amigo me brindo un hogar, para así ayudarme a que me recupere emocional y laboralmente. No pasó mucho tiempo desde ese momento hasta que encontré una nueva empresa que confiaba en mí para algo en lo que hasta el momento me desempeñaba muy bien... estar entre las chispas de soldadura y reparar cosas. Solo que esta vez no eran barcos... sino frigoríficos de carne, empresas de chacinados, industrias petroleras, cámaras de atmosfera para frutas, empresas de productos lácteos... otra vez los metales se apoderaban de mi vida.\nToda la Argentina al alcance de mi mano, viajar se convirtió en mi desahogo y en una forma de reconstruirme. Buenos Aires, Entre Ríos, Córdoba, La Pampa, Río Negro, Neuquén, etc. Nunca había un destino fijo con ellos y eso me gustaba, conocer lugares nuevos, gente nueva y pensamientos nuevos yendo a trabajar me llenaba. Aprendía todos los días, me formaba constantemente con cursos respecto a mi oficio, me calificaba profesionalmente en todas las clases y tipos de soldaduras, distintos materiales de fusión y demás.\nMás de 15 años pasaron desde que comencé con la empresa y entre idas y vueltas (a veces por hacer trabajos por mi cuenta) siempre volvía y tenían un lugar para mí, estaba muy cómodo... pero otra vez la piedra se volvía a cruzar en el camino. Después de tanto tiempo la historia se volvía a repetir. La administración cambiaba, pero esta vez no me decían que me vaya... pero si lo insinuaron en más de una ocasión, ya nada era lo mismo. Enfrentando la realidad y en medio de una pandemia que ya era un hecho, no me dejaron otra alternativa más que bajar la cabeza y retirarme."
  },
  "parrafo6": {
    "title": "La varita mágica",
    "description": "Tal fue mi suerte en ese momento que en medio de un mundo totalmente desolado, desordenado y lleno de caos por el COVID, conseguí una empresa en la cual comenzar a trabajar nuevamente tan solo a 3 cuadras de la casa que alquilaba en ese momento junto a mi pareja. Haciendo lo que más me gustaba y sabía hacer, estar entre las chispas.\nPoco tiempo pasó desde que vieron mi forma de trabajar y desenvolverme, hasta subir un escalón y pasar a estructurar la gente, los grupos de trabajo, los planos de los diferentes proyectos, tratar con ingenieros de las diferentes plantas a donde concurríamos... y entonces el último escalón comenzó a verse muy cerca desde donde me encontraba. Más fue la pena que la alegría lo que se apoderó de mí en ese momento, pensar en no tener un 'más allá' que eso, en quedarme sin la oportunidad de seguir aprendiendo y desarrollándome. Para algunas personas estar así puede ser un beneficio... para mí, fue todo lo contrario. Todo esto terminó por opacar mi día a día y mi trabajo pasó a ser algo monótono.\nNecesitaba una salida mental en algo que me presentara nuevos desafíos."
  },
  "parrafo7": {
    "title": "El despertar de la fuerza",
    "description": "Con mi estado mental bastante hecho un caos por culpa de la monotonía laboral, necesitaba una salida urgente para normalizar la cabeza... y otra vez la buena suerte se presentaba. Un día me reuní a charlar un poco con un amigo/hermano de toda la vida, desarrollador de software y líder técnico de una de las empresas más grandes e importantes de Latinoamérica (no es porque sea mi amigo, pero para mí es el mejor) y me dijo: '¿Por qué no aprendés a programar? Vos tenés madera para eso...' (textuales palabras)\nAl principio no le presté mucha importancia, pero la idea quedó implantada ahí en mi cabeza como una semilla que fue arrojada para ver si crecía algo. No lo vi muy factible para mí, pero sí para mi pareja y así fue como ella se adentró en el famoso e interrogante mundo de la programación.\nComenzando con una formación básica de desarrollo web de una reconocida plataforma, a medida que los días pasaban y el desarrollo avanzaba, dicha formación también aumentaba su dificultad... tal fue el día que me preguntó si podía ayudarla con algo que no comprendía. Aturdido por la situación, entre los dos pensamos en como resolver un problema de lógica básica en JavaScript con los pocos conceptos que hasta entonces ella tenía y pudimos llegar a una solución que no era para nada igual a la solución final que brindaba la plataforma, pero que igualmente funcionaba... en ese momento la chispa se encendió en mi cabeza, me di cuenta de todo el potencial que tenían y escondían los lenguajes de programación, y la infinidad de cosas que se podían llegar a realizar con ellos de diferentes formas y maneras... la imaginación era el límite."
  },
  "parrafo8": {
    "title": "Un punto sin retorno",
    "description": "Convencido de que en algún momento mi pareja volvería a tratar de pedirme ayuda con su formación y con temor a no poder ayudarla (actualmente se dedica al diseño UX/UI) decido ver de que se trataba y aprender un poco más sobre el tema. Y así comencé, con cursos básicos de HTML, CSS y JavaScript, ese fue el punto sin retorno... algo se había apoderado de mí y yo aún sin saberlo. Fue tanta la emoción y el entusiasmo que me generó, que constantemente estaba pensando en ello, como si hubiera descubierto el fuego... soñaba con código, literalmente... aprovechaba en mi trabajo los ratos libres o el horario del almuerzo para diseñar botones con CSS, practicar bucles, aprender sintaxis, y todo lo que podía llegar a lograr en un editor de código para el celular. Llegar tarde a casa, pero con ganas de quedarme practicando era normal, o esperar toda la semana para poder levantarme un sábado o un domingo bien temprano para tener más tiempo para estudiar.\nCon el tiempo llegué a facilitarles a mis compañeros de trabajo una aplicación web diseñada y programada por mí con conocimientos básicos, para su control de horas y cuanto debería cobrar cada uno según la cantidad de horas trabajadas, horas extras, días feriados o fines de semana para que no tuvieran problemas con su remuneración... aplicación que hasta la misma gente de administración terminó utilizando por la simpleza y la agilización que esta le proporcionaba.\nMi cabeza ya estaba en otro lado, y así en poco tiempo la programación pasó a ser una necesidad, liberó mi mente, me dio una nueva perspectiva en la vida y un estado mental que hace mucho tiempo no conseguía."
  },
  "parrafo9": {
    "title": "Gracias por todo y buena suerte",
    "description": "Determinado a continuar con lo que había descubierto que me apasionaba, con la necesidad de avanzar y cada día poder crear cosas nuevas, fui profundizando en el desarrollo web en distintas formaciones. Plataformas para el celular como SoloLearn se hicieron presentes, otras como Argentina Programa con un básico de Ruby, Alura Latam con Java y SpringBoot, freeCodeCamp con JavaScript y React.\nTambién buscando contenido gratuito me encontré con el canal de YouTube de JonMircha, fue mi Edutuber más referente e influyente en el comienzo de mi etapa de desarrollo (hasta el día de hoy lo sigo consultando) y otras plataformas en las cuales prometían volverte un desarrollador en tan solo 6 meses. No sé si era verdad o mentira... yo iba a tardar un poco más por los horarios laborales y mis pocos momentos libres para poder concentrarme al 100% en el estudio, eso lo tenía asumido... trabajar y estudiar se hacía un poco difícil.\nTal así que un día, después de 2 años aproximadamente desde que la chispa se encendió en mi cabeza y viendo el avance que había logrado, tomé la decisión de renunciar a mi empleo actual, el cual ya había cumplido su ciclo lamentablemente, para poder dedicarme tiempo completo a pulir conceptos que me faltaban en JavaScript y ReactJS, poder desarrollar una buena cantidad de proyectos, adquirir practica con mis conocimientos y así poder dedicarme al desarrollo web laboralmente.\nEntrar al mundo IT, algo que jamás pensé y que hoy podía ser una realidad después de muchas vueltas de la vida."
  },
  "parrafo10": {
    "title": "Un nuevo amanecer...",
    "description": "Actualmente, trabajo como freelance, encontré algo que me lleva hasta el límite y me desafía constantemente. Muchos pueden decir que ya estoy grande para empezar algo así desde cero, es como volver a bordo de mis queridos barcos, que en su momento supieron darme mi primera oportunidad y su primer eslabón de la cadena... yo digo que la edad está solo en la mente, y que la fascinación que me provoca escribir una línea de código, ver como todo va tomando su forma y cada pieza del rompecabezas encaja en su lugar, no se compara con nada... y no se encuentra fácilmente a la vuelta de la esquina, hoy puedo asegurar que puedo dedicarme a esto y continuar aprendiendo sin un límite por el que preocuparme.\nSi llegaste hasta aquí, espero que haya resultado interesante y de tu agrado leer la historia de un desconocido que no tiene final, es solo el comienzo de algo más grande.\nMuchas gracias por el tiempo, la dedicación y la paciencia.\n¡Saludos cordiales!"
  }
}

